*** Implementations

    #+macro: asymmetry-caption Asymmetry point finder, $1 solution

    #+CAPTION: {{{asymmetry-caption(Python)}}} \cite{Komanec:201602:Codility:Gist}
    #+NAME: src|python|asymmetry-solution
    #+BEGIN_SRC python
      def solution(anchor, list_of_elements):
              n = len(list_of_elements)
              right = sum(1 for item in list_of_elements if item != anchor)
              left = 0
              for k, element in enumerate(list_of_elements, start=1):
                      if element == anchor:
                              left += 1
                      else:
                              right -= 1
                      if right and left == right:
                              return k
              return -1
    #+END_SRC


    #+CAPTION: {{{asymmetry-caption(Javascript)}}}
    #+NAME: src|js|asymmetry-solution
    #+BEGIN_SRC js
      function solution(anchor, list_of_elements) {
          var l            = list_of_elements.length
          var left_hits    = 0
          var right_misses = 0
          for(i=0; i<l;i++){
              if(list_of_elements[i]!==anchor){
                  right_misses++
              }
          }
          for(i = 1; i < l; i++) {
              if(list_of_elements[i]===anchor){
                  left_hits++
              } else {
                  right_misses--
              }
              if (right_misses===left_hits){
                  return i
              }
          }
          return -1
      }
    #+END_SRC

    #+NAME: src|js|asymmetry-solution-caller
    #+BEGIN_SRC js :var element=1 :var elist='() :noweb yes :exports none
      <<src|js|asymmetry-solution>>
      return solution(element, elist);
    #+END_SRC

    #+NAME: src|python|asymmetry-solution-caller
    #+BEGIN_SRC python :var element=1 :var elist='() :noweb yes :exports none
      <<src|python|asymmetry-solution>>
      return solution(element, elist)
    #+END_SRC

    #+CAPTION: Test table (list of elements represented in elisp)
    #+BEGIN_TABLE
    #+LATEX: \makebox[\textwidth][c]{
    #+ATTR_LATEX: :align |l|l|l|l|l|l|l|
    | el | list of elements                                 | expected | python |    js |
    |----+--------------------------------------------------+----------+--------+-------|
    |  5 | '(5 5 1 7 2 3 5)                                 |        4 |      4 |     4 |
    |  1 | '()                                              |       -1 |     -1 |    -1 |
    |  1 | (make-list 20 0)                                 |       -1 |     -1 |    -1 |
    |  1 | '(1 1 1 1 1 1 1 1 1 2)                           |        1 |      1 |     1 |
    |  1 | (append (make-list 50 1) (make-list 50 0))       |       50 |     50 |    50 |
    |  1 | (append (make-list 50000 1) (make-list 50000 0)) |    50000 |  50000 | 50000 |
    #+TBLFM: $4='(org-sbe "src|python|asymmetry-solution-caller" (element $1) (elist $2))::$5='(org-sbe "src|js|asymmetry-solution-caller" (element $1) (elist $2))
    #+LATEX: }
    #+END_TABLE

*** Implementations

    #+MACRO: negabinary-caption Negabinary Solution, $1 solution
    #+CAPTION: {{{negabinary-caption(Python)}}} \cite{Komanec:201602:Codility:Gist}
    #+NAME: src|python|negabinary-solution
    #+BEGIN_SRC python
      def to_binary(n):
              if n == -1:
                      return [1]
              else:
                      return [-1*(n%-2)] + to_binary(n/-2)

      def solution(A):
              num = sum(bit*(-2)**i for i, bit in enumerate(A) if bit != 0)
              return to_binary(num)
    #+END_SRC

    #+NAME: src|js|to-decimal
    #+BEGIN_SRC js :exports none
      function toDecimalRepresentation(num_array, base){
          var decimal_representation =0
          var current_digit          =0
          var len                    = num_array.length
          for (var i=0; i < len;i++){
              current_digit=num_array[i];
              if(current_digit!==0){
                  decimal_representation+=(current_digit*(Math.pow(base, (len-(i+1)))))
              }
          }
          return decimal_representation;
      }
    #+END_SRC

    #+NAME: src|js|to-decimal-caller
    #+BEGIN_SRC js :var numarray='() base=1 :noweb yes :exports none
      <<src|js|to-decimal>>
      return toDecimalRepresentation(numarray, base);
    #+END_SRC

    #+BEGIN_COMMENT
    #+CAPTION: Decimal JS test table
    | num          | base | expected | js |
    |--------------+------+----------+----|
    | '(1 0 1 0)   |    2 |       10 | 10 |
    | '(1 0 1)     |    3 |       10 | 10 |
    | '(2 2)       |    4 |       10 | 10 |
    | '(1 1)       |    9 |       10 | 10 |
    | '(1 1 1 1)   |   -2 |       -5 | -5 |
    | '(1 1 0 1 0) |   -2 |        6 |  6 |
    #+TBLFM: $4='(org-sbe "src|js|to-decimal-caller" (numarray $1) (base $2))
    #+END_COMMENT

    #
    #+NAME: src|js|negabinary-solution
    #+BEGIN_SRC js :noweb yes
      <<src|js|to-decimal>>

      Math.trunc = Math.trunc || function(x) {
          return x < 0 ? Math.ceil(x) : Math.floor(x);
      }

      function toNegaBase(number, base){
          var nega_num_array = []
          var current_num    = number
          var remainder      = 0
          while (current_num !== 0){
              var remainder = current_num % base
              current_num = Math.trunc((current_num / base))
              if (remainder < 0) {
                  current_num+=1
                  remainder+= Math.abs(base)
              }
              nega_num_array=[remainder].concat(nega_num_array)
          }
          return nega_num_array;
      }
    #+END_SRC

    #+CAPTION: {{{negabinary-caption(Javascript)}}}
    #+NAME: src|js|negabinary-solution-caller
    #+BEGIN_SRC js :var binary='() :noweb yes
          <<src|js|negabinary-solution>>
          return toNegaBase((-1*toDecimalRepresentation(binary.reverse(), -2)),
                            -2).reverse()
    #+END_SRC

    #+NAME: src|python|negabinary-solution-caller
    #+BEGIN_SRC python :var binary='() :noweb yes :exports none
      <<src|python|negabinary-solution>>
      return solution(binary)
    #+END_SRC

    #+BEGIN_COMMENT
    #+CAPTION: Negabinary test table
    #+BEGIN_TABLE
    #+LATEX: \makebox[\textwidth][c]{
    #+ATTR_LATEX: :align |l|l|l|l|l|l|l|
    | binary         | expected         | python          | js              |
    |----------------+------------------+-----------------+-----------------|
    | '(1 0 0 1 1)   | '(1 1 0 1)       | (1 1 0 1)       | (1 1 0 1)       |
    | '(1 0 0 1 1 1) | '(1 1 0 1 0 1 1) | (1 1 0 1 0 1 1) | (1 1 0 1 0 1 1) |
    #+TBLFM: $3='(org-sbe "src|python|negabinary-solution-caller" (binary $1))::$4='(org-sbe "src|js|negabinary-solution-caller" (binary $1))
    #+LATEX: }
    #+END_TABLE
    #+END_COMMENT

**** [[knight-metric-description][Knight Metric]]

    #+CAPTION: Javascript knight metric, JS version
    #+NAME: src|js|knight-metric
    #+BEGIN_SRC javascript
      function knight_metric(x_1, y_1, x_2, y_2){
          var u_1 = (x_1 - y_1)
          var u_2 = (x_2 - y_2)
          var m = Math.min (Math.abs(u_1), Math.abs(u_2))
          var M = Math.max (Math.abs(u_1), Math.abs(u_2))
          if ((M===1) && (m===0)) {
              return 3
          } else if ((M===2) && (m===2)){
              return 4
          } else {
              var max = Math.max(Math.ceil(M/2), Math.ceil((M+m)/3))
              var rslt = max + (M + m) - (max%2)
              return rslt
          }
      }
    #+END_SRC

    #+NAME: src|js|knight-metric-caller
    #+BEGIN_SRC js :var x=1 y=1 :noweb yes :exports none
          <<src|js|knight-metric>>
          return knight_metric(0,0,x,y);
    #+END_SRC

    #+CAPTION: Knight metric test table
    #+NAME: tbl:knight-metric
    #+BEGIN_TABLE
    #+LATEX: \makebox[\textwidth][c]{
    #+ATTR_LATEX: :align |l|l|l|l|l|l|l|
    | x | y | expected | js metric |        js distance |
    |---+---+----------+-----------+--------------------|
    | 3 | 6 |        3 |         5 |                  3 |
    | 1 | 2 |        1 |         3 |                  1 |
    | 5 | 7 |        4 |         2 |                  4 |
    | 2 | 2 |        4 |         0 | 1.3333333333333333 |
    | 5 | 4 |        3 |         3 |                  3 |
    #+TBLFM: $4='(org-sbe "src|js|knight-metric-caller" (x $1) (y $2))::$5='(org-sbe "src|js|knight-distance-caller" (x $1) (y $2))
    #+LATEX: }
    #+END_TABLE

   As one can see from [[tbl:knight-metric]], both the [[knight-distance-description][Knight Distance]]
   and the [[knight-metric-description][Knight Metric]] algorithms or their implementations are
   wrong.
